# long data 만들기 

-각 변수는 하나의 컬럼에 배치
- 각 관측치는 한행에 1건씩 분리되어 배치 
- 각 값은 개별 셀에 배치

-melt()
-piovt()
-pivot_table(): 집계함수 적용

In [2]:
import pandas as pd

In [5]:
df=pd.read_csv(r'./data/pew.csv')
type(df)

pandas.core.frame.DataFrame

In [6]:
df.head(2)

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76

In [7]:
pd.melt(df)

               variable               value
0              religion            Agnostic
1              religion             Atheist
2              religion            Buddhist
3              religion            Catholic
4              religion  Don’t know/refused
..                  ...                 ...
193  Don't know/refused                  73
194  Don't know/refused                  18
195  Don't know/refused                  71
196  Don't know/refused                   8
197  Don't know/refused                 597

[198 rows x 2 columns]

In [12]:
df.melt(id_vars='religion').sort_values('religion').head(18)

     religion            variable  value
0    Agnostic               <$10k     27
144  Agnostic               >150k     84
162  Agnostic  Don't know/refused     96
126  Agnostic           $100-150k    109
36   Agnostic             $20-30k     60
108  Agnostic            $75-100k    122
18   Agnostic             $10-20k     34
90   Agnostic             $50-75k    137
72   Agnostic             $40-50k     76
54   Agnostic             $30-40k     81
109   Atheist            $75-100k     73
19    Atheist             $10-20k     27
55    Atheist             $30-40k     52
91    Atheist             $50-75k     70
127   Atheist           $100-150k     59
145   Atheist               >150k     74
73    Atheist             $40-50k     35
37    Atheist             $20-30k     37

In [13]:
df_melt=df.melt(id_vars='religion')
df_melt

                  religion            variable  value
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [16]:
cond=df_melt['religion']=='Agnostic'

In [17]:
df_melt.loc[cond]

     religion            variable  value
0    Agnostic               <$10k     27
18   Agnostic             $10-20k     34
36   Agnostic             $20-30k     60
54   Agnostic             $30-40k     81
72   Agnostic             $40-50k     76
90   Agnostic             $50-75k    137
108  Agnostic            $75-100k    122
126  Agnostic           $100-150k    109
144  Agnostic               >150k     84
162  Agnostic  Don't know/refused     96

In [ ]:
df_melt_rename=df_melt.rename(columns={'variable':'income','value':'conunt'})

In [21]:
df_melt_rename

                  religion              income  conunt
0                 Agnostic               <$10k      27
1                  Atheist               <$10k      12
2                 Buddhist               <$10k      27
3                 Catholic               <$10k     418
4       Don’t know/refused               <$10k      15
..                     ...                 ...     ...
175               Orthodox  Don't know/refused      73
176        Other Christian  Don't know/refused      18
177           Other Faiths  Don't know/refused      71
178  Other World Religions  Don't know/refused       8
179           Unaffiliated  Don't know/refused     597

[180 rows x 3 columns]

In [25]:
df1=pd.read_csv(r'./data/billboard.csv')
df1

,year,artist,track,time,date.entered,wk1,wk2,wk3,wk4,wk5,...,wk67,wk68,wk69,wk70,wk71,wk72,wk73,wk74,wk75,wk76
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,87,82.0,72.0,77.0,87.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2000,2Ge+her,The Hardest Part Of ...,3:15,2000-09-02,91,87.0,92.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2000,3 Doors Down,Kryptonite,3:53,2000-04-08,81,70.0,68.0,67.0,66.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2000,3 Doors Down,Loser,4:24,2000-10-21,76,76.0,72.0,69.0,67.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2000,504 Boyz,Wobble Wobble,3:35,2000-04-15,57,34.0,25.0,17.0,17.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
312,2000,Yankee Grey,Another Nine Minutes,3:10,2000-04-29,86,83.0,77.0,74.0,83.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
313,2000,"Yearwood, Trisha",Real Live Woman,3:55,2000-04-01,85,83.0,83.0,82.0,81.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
314,2000,Ying Yang Twins,Whistle While You Tw...,4:19,2000-03-18,95,94.0,91.0,85.0,84.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
315,2000,Zombie Nation,Kernkraft 400,3:30,2000-09-02,99,99.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
316,2000,matchbox twenty,Bent,4:12,2000-04-29,60,37.0,29.0,24.0,22.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [33]:
df1_melt=df1.melt(id_vars='artist')
cond1=df1_melt['artist']=='2 Pac'
df1_melt.loc[cond1]
df1_melt_rename=df1_melt.rename(columns={'variable':'Music time','value':'year'})
df1_melt_rename

                 artist Music time  year
0                 2 Pac       year  2000
1               2Ge+her       year  2000
2          3 Doors Down       year  2000
3          3 Doors Down       year  2000
4              504 Boyz       year  2000
...                 ...        ...   ...
25355       Yankee Grey       wk76   NaN
25356  Yearwood, Trisha       wk76   NaN
25357   Ying Yang Twins       wk76   NaN
25358     Zombie Nation       wk76   NaN
25359   matchbox twenty       wk76   NaN

[25360 rows x 3 columns]

# aply

In [36]:
df=pd.DataFrame({
  "a":[10,20,30],
  "b":[20,30,40]
})
df**2

     a     b
0  100   400
1  400   900
2  900  1600

In [ ]:
df/10 #vectorisation

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  4.0

In [42]:
def make_sq(x,e=2):
    return x**e

In [43]:
df.apply(make_sq,e=2.71)

              a             b
0    512.861384   3355.763054
1   3355.763054  10069.284236
2  10069.284236  21957.484078

In [45]:
import pandas as pd

# 직원 명단 DataFrame 생성
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 45, 35, 32, 28],
    'Salary': [5000, 7000, 6500, 5500, 6000]
}
sal_df=pd.DataFrame(data)
sal_df

      Name  Age  Salary
0    Alice   25    5000
1      Bob   45    7000
2  Charlie   35    6500
3    David   32    5500
4      Eva   28    6000

In [56]:
def age_category(age):
  if age<30:
     return '20대'
  elif age<40 :
    return '30대'
  else:
    return '40대'

In [57]:
sal_df['Age_category']=sal_df['Age'].apply(age_category)
sal_df

      Name  Age  Salary Age_category   Bonus
0    Alice   25    5000          20대  1000.0
1      Bob   45    7000          40대  1400.0
2  Charlie   35    6500          30대  1300.0
3    David   32    5500          30대  1100.0
4      Eva   28    6000          20대  1200.0

In [53]:
# 보우너스
sal_df['Bonus'] = sal_df['Salary'] * 0.2

In [55]:
sal_df

      Name  Age  Salary Age_category   Bonus
0    Alice   25    5000          20대  1000.0
1      Bob   45    7000          영포티  1400.0
2  Charlie   35    6500          30대  1300.0
3    David   32    5500          30대  1100.0
4      Eva   28    6000          20대  1200.0

# 데이터 병합

In [3]:
df_1=pd.read_csv('./data/concat_1.csv')
df_2=pd.read_csv('./data/concat_2.csv')
df_3=pd.read_csv('./data/concat_3.csv')

In [4]:
df_1,df_2,df_3

(    A   B   C   D
 0  a0  b0  c0  d0
 1  a1  b1  c1  d1
 2  a2  b2  c2  d2
 3  a3  b3  c3  d3,
     A   B   C   D
 0  a4  b4  c4  d4
 1  a5  b5  c5  d5
 2  a6  b6  c6  d6
 3  a7  b7  c7  d7,
      A    B    C    D
 0   a8   b8   c8   d8
 1   a9   b9   c9   d9
 2  a10  b10  c10  d10
 3  a11  b11  c11  d11)

In [5]:
total_df=pd.concat([df_1,df_2,df_3],ignore_index=True)

In [6]:
total_df.loc[3]

A    a3
B    b3
C    c3
D    d3
Name: 3, dtype: object

In [7]:
#
# total_df.iloc[3]
total_df.reset_index()#
total_df

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

In [12]:
add_ser = pd.Series(['a100', 'b100', 'c100', 'd100'], index=['A', 'B', 'C', 'D']).to_frame().T

In [14]:
total_df_add=pd.concat([total_df,add_ser],ignore_index=True)
total_df_add

       A     B     C     D
0     a0    b0    c0    d0
1     a1    b1    c1    d1
2     a2    b2    c2    d2
3     a3    b3    c3    d3
4     a4    b4    c4    d4
5     a5    b5    c5    d5
6     a6    b6    c6    d6
7     a7    b7    c7    d7
8     a8    b8    c8    d8
9     a9    b9    c9    d9
10   a10   b10   c10   d10
11   a11   b11   c11   d11
12  a100  b100  c100  d100

시리즈를 행으로-> concat

-dataframe(원본과 동일한 column을 같는 데이터프레임 생성)
-column = 인덱스이름 시리즈 생성
-빈데이터프레임에 행으로 시리즈를 추가
-concat(원본,빈데이터 프레임)

# merge()
- 키를 기준으로 합친다
- sql 에서 join

In [2]:
import pandas as pd

In [ ]:
# 매출데이터
sales_data = pd.DataFrame({ 'CustomerID': [101, 102, 103, 104], 'Date': ['2023-01-01', '2023-01-03', '2023-01-05', '2023-01-07'], 'Amount': [250, 300, 150, 400] })
# 고객데이터
customer_data = pd.DataFrame({ 'CustomerID': [101, 102, 103, 105], 'Name': ['Alice', 'Bob', 'Charlie', 'Eva'], 'Region': ['North', 'South', 'East', 'West'] })

In [5]:
sales_data.info()
customer_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  4 non-null      int64
 1   Date        4 non-null      object
 2   Amount      4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  4 non-null      int64
 1   Name        4 non-null      object
 2   Region      4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [8]:
pd.merge(customer_data,sales_data,on='CustomerID')

   CustomerID     Name Region        Date  Amount
0         101    Alice  North  2023-01-01     250
1         102      Bob  South  2023-01-03     300
2         103  Charlie   East  2023-01-05     150

In [10]:
pd.merge(customer_data,sales_data,on='CustomerID',how='right')

   CustomerID     Name Region        Date  Amount
0         101    Alice  North  2023-01-01     250
1         102      Bob  South  2023-01-03     300
2         103  Charlie   East  2023-01-05     150
3         104      NaN    NaN  2023-01-07     400

how- 병합 기준 지정
- left
- right 
- inner(default)
- outer 
- on(병합키 지정)

# 그룹연산
groupby() + aggregation 집계

In [16]:
gap_df=pd.read_csv(r'./data/gapminder.tsv',sep='\t')
gap_df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [18]:
gap_df.tail(5)

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [19]:
gap_df.country.unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [26]:
gap_df['country'].unique().shape

(142,)

In [28]:
gap_df['continent'].unique().shape
gap_df['continent'].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [29]:
gap_df['year'].unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007])

In [56]:
gap_df.groupby('country')[['lifeExp']].count().describe()

       lifeExp
count    142.0
mean      12.0
std        0.0
min       12.0
25%       12.0
50%       12.0
75%       12.0
max       12.0

In [37]:
gap_df.groupby('country').get_group('Afghanistan')

        country continent  year  lifeExp       pop   gdpPercap
0   Afghanistan      Asia  1952   28.801   8425333  779.445314
1   Afghanistan      Asia  1957   30.332   9240934  820.853030
2   Afghanistan      Asia  1962   31.997  10267083  853.100710
3   Afghanistan      Asia  1967   34.020  11537966  836.197138
4   Afghanistan      Asia  1972   36.088  13079460  739.981106
5   Afghanistan      Asia  1977   38.438  14880372  786.113360
6   Afghanistan      Asia  1982   39.854  12881816  978.011439
7   Afghanistan      Asia  1987   40.822  13867957  852.395945
8   Afghanistan      Asia  1992   41.674  16317921  649.341395
9   Afghanistan      Asia  1997   41.763  22227415  635.341351
10  Afghanistan      Asia  2002   42.129  25268405  726.734055
11  Afghanistan      Asia  2007   43.828  31889923  974.580338

In [44]:
gap_df.groupby('continent')['country'].count()

continent
Africa      624
Americas    300
Asia        396
Europe      360
Oceania      24
Name: country, dtype: int64

In [45]:
gap_df.groupby('continent')['country'].count().std()

215.4325880641088

In [53]:
gap_df.groupby('continent')['country'].count().describe()

count      5.000000
mean     340.800000
std      215.432588
min       24.000000
25%      300.000000
50%      360.000000
75%      396.000000
max      624.000000
Name: country, dtype: float64

# 자동차 생산량 데이터 모양 만들기

In [75]:
veh_df=pd.read_csv('./data/vehicle_prod.csv',index_col=0)

In [76]:
veh_df.rename(columns={'Unnamed: 0':'Country'},inplace=True)
veh_df

         2007   2008   2009   2010   2011
China    7.71   7.95  11.96  15.84  16.33
EU      19.02  17.71  15.00  16.70  17.48
US      10.47   8.45   5.58   7.60   8.40
Japan   10.87  10.83   7.55   9.09   7.88
Korea    4.04   3.78   3.45   4.20   4.62
Mexico   2.01   2.05   1.50   2.25   2.54

In [82]:
(veh_df[['2007']])

         2007
China    7.71
EU      19.02
US      10.47
Japan   10.87
Korea    4.04
Mexico   2.01

In [84]:
veh_df.sum()

2007    54.12
2008    50.77
2009    45.04
2010    55.68
2011    57.25
dtype: float64

In [ ]:
# 총생산량

In [86]:
veh_df['total_production']=veh_df.sum(axis=1)
veh_df

         2007   2008   2009   2010   2011  total_production
China    7.71   7.95  11.96  15.84  16.33            119.58
EU      19.02  17.71  15.00  16.70  17.48            171.82
US      10.47   8.45   5.58   7.60   8.40             81.00
Japan   10.87  10.83   7.55   9.09   7.88             92.44
Korea    4.04   3.78   3.45   4.20   4.62             40.18
Mexico   2.01   2.05   1.50   2.25   2.54             20.70

# 결측치처리

In [88]:
import numpy as np
pd.NA,np.nan

(<NA>, nan)

In [89]:
pd.isnull(np.nan),pd.isnull(pd.NA)

(True, True)

In [91]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'age': [25, np.nan, 30, 22, np.nan],
    'score': [90, 85, np.nan, 88, 95],
    'city': ['Seoul', 'Busan', np.nan, 'Incheon', 'Seoul']
}
data

{'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
 'age': [25, nan, 30, 22, nan],
 'score': [90, 85, nan, 88, 95],
 'city': ['Seoul', 'Busan', nan, 'Incheon', 'Seoul']}

In [92]:
df = pd.DataFrame(data)

# 결측치 채우기 및 포맷 정리
df['age'] = df['age'].fillna(df['age'].mean()).round(1)
df['score'] = df['score'].fillna(df['score'].mean()).round(1)
df['city'] = df['city'].fillna('Unknown')